performance/jmeter/jmeter.log
2026-01-23 17:04:17,740 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-01-23 17:04:17,771 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2026-01-23 17:04:17,771 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2026-01-23 17:04:17,771 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2026-01-23 17:04:17,771 INFO o.a.j.JMeter: Setting JMeter property: host=localhost
2026-01-23 17:04:17,772 INFO o.a.j.JMeter: Setting JMeter property: port=8080
2026-01-23 17:04:17,772 INFO o.a.j.JMeter: Setting JMeter property: threads=1
2026-01-23 17:04:17,772 INFO o.a.j.JMeter: Setting JMeter property: rampUp=1
2026-01-23 17:04:17,772 INFO o.a.j.JMeter: Setting JMeter property: duration=1
2026-01-23 17:04:17,785 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2026-01-23 17:04:17,786 INFO o.a.j.JMeter: Version 5.5
2026-01-23 17:04:17,786 INFO o.a.j.JMeter: java.version=1.8.0_275
2026-01-23 17:04:17,786 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-01-23 17:04:17,786 INFO o.a.j.JMeter: os.name=Linux
2026-01-23 17:04:17,786 INFO o.a.j.JMeter: os.arch=amd64
2026-01-23 17:04:17,786 INFO o.a.j.JMeter: os.version=6.17.0-8-generic
2026-01-23 17:04:17,786 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-01-23 17:04:17,787 INFO o.a.j.JMeter: java.awt.headless=true
2026-01-23 17:04:17,787 INFO o.a.j.JMeter: Max memory     =3749707776
2026-01-23 17:04:17,787 INFO o.a.j.JMeter: Available Processors =8
2026-01-23 17:04:17,799 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-01-23 17:04:17,799 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-01-23 17:04:17,799 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2026-01-23 17:04:17,800 INFO o.a.j.JMeter: user.dir  =/jmeter
2026-01-23 17:04:17,800 INFO o.a.j.JMeter: PWD       =/jmeter
2026-01-23 17:04:17,800 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: 00fdfe06e1c9 FullName: 00fdfe06e1c9
2026-01-23 17:04:17,841 INFO o.a.j.s.FileServer: Default base='/jmeter'
2026-01-23 17:04:17,842 INFO o.a.j.s.FileServer: Set new base='/jmeter'
2026-01-23 17:04:18,006 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-01-23 17:04:18,032 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-01-23 17:04:18,038 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-01-23 17:04:18,047 INFO o.a.j.s.SaveService: Loading file: /jmeter/valida-cpf.jmx
2026-01-23 17:04:18,117 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-23 17:04:18,117 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-23 17:04:18,117 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-23 17:04:18,118 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-23 17:04:18,118 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-01-23 17:04:18,118 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-01-23 17:04:18,638 INFO o.a.j.JMeter: Creating summariser <summary>
2026-01-23 17:04:18,667 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-01-23 17:04:18,668 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-01-23 17:04:18,668 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-01-23 17:04:18,677 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-01-23 17:04:18,678 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-01-23 17:04:19,070 INFO o.a.j.JMeter: Running test (1769184259070)
2026-01-23 17:04:19,164 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Carga - Validar CPF
2026-01-23 17:04:19,164 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Carga - Validar CPF.
2026-01-23 17:04:19,164 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-01-23 17:04:19,164 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2026-01-23 17:04:19,170 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-01-23 17:04:19,170 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-01-23 17:04:19,210 INFO o.a.j.t.JMeterThread: Thread started: Carga - Validar CPF 1-1
2026-01-23 17:04:19,212 INFO o.a.j.s.FileServer: Stored: cpfs.csv
2026-01-23 17:04:19,240 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 00fdfe06e1c9
2026-01-23 17:04:19,248 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-01-23 17:04:19,250 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-01-23 17:04:19,250 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2026-01-23 17:04:19,250 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-01-23 17:04:19,250 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-01-23 17:04:20,164 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Carga - Validar CPF 1-1
2026-01-23 17:04:20,164 INFO o.a.j.t.JMeterThread: Thread finished: Carga - Validar CPF 1-1
2026-01-23 17:04:20,165 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-01-23 17:04:20,166 INFO o.a.j.s.FileServer: Close: cpfs.csv
2026-01-23 17:04:20,167 INFO o.a.j.r.Summariser: summary =    742 in 00:00:01 =  677.0/s Avg:     0 Min:     0 Max:    33 Err:   742 (100.00%)